app/views/chat_rooms/_chat_room.html.erb

<h2><%= "#{chat_room.title}" %></h2>
<p><strong><%= "#{chat_room.messages.size}" %></strong>
---
SELECT COUNT(*) FROM "messages" WHERE "messages"."chat_room_id" = ?  [["chat_room_id", 1]]