app/views/chat_rooms/show.html.erb


<% if @chat_room.messages.size < 1 %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = 1